Test/ToolOpenFoamErrorRhosimplefoamCannotFindEquationRelaxationFactorForPeqnOrAsuitableDefaultValue/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             steadyState;
}

gradSchemes
{
    default             Gauss linear;
}

divSchemes
{
    default             none;

    div(phi,U)          Gauss upwind;
    div((muEff*dev2(T(grad(U)))))      Gauss linear;
    div(phi,h)          Gauss upwind;
    div(phi,epsilon)    Gauss upwind;
    div(phi,k)          Gauss upwind;

    div(phid,p)         Gauss upwind;
    div(phi,K)          Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
    UD              upwind phid;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p;
    pCorr;
}

// ************************************************************************* //
